export const distortions = [
  {
    distortionName: "Мышление «всё или ничего»",
    distortionDescription:
      "Для вас существуют только крайности, только черное и белое. Если вы не достигли абсолютного успеха, то считаете себя полным неудачником.",
  },
  {
    distortionName: "Сверхобобщение",
    distortionDescription:
      "Одно негативное событие для вас является свидетельством непрекращающейся череды неудач. Возможно, вы говорите самому себе: «Ну, так всегда и происходит» или «У меня никогда ничего не выйдет».",
  },
  {
    distortionName: "Негативный фильтр",
    distortionDescription:
      "Это искажение подобно капле чернил, которая меняет цвет воды во всем кувшине. Вы цепляетесь за одну негативную деталь, такую как совершенная вами ошибка, и игнорируете все, что сделали хорошо.",
  },
  {
    distortionName: "Обесценивание положительного",
    distortionDescription:
      "Вы уверены, что ваши достижения и положительные качества ничего не стоят.",
  },
  {
    distortionName: "Поспешные выводы: чтение мыслей",
    distortionDescription:
      "Вы делаете поспешные выводы, не подкрепленные фактами. Вы безосновательно предполагаете, что люди относятся к вам с осуждением и презрением.",
  },
  {
    distortionName: "Поспешные выводы: ошибка предсказания",
    distortionDescription:
      "Вы делаете поспешные выводы, не подкрепленные фактами. Вы убеждаете себя, что произойдет нечто ужасное: «Я просто знаю, что провалюсь на экзаменах на следующей неделе».",
  },
  {
    distortionName: "Преувеличение и преуменьшение",
    distortionDescription:
      "Вы раздуваете одни факты до огромного размера, а другие полностью лишаете значимости. Это также называется эффектом бинокля. Вы смотрите в бинокль с одного конца, и все ваши несовершенства кажутся огромными, как гора Эверест. А когда смотрите с другого конца, то видите, что ваши сильные стороны и положительные качества сжались до ничтожного размера.",
  },
  {
    distortionName: "Эмоциональное обоснование",
    distortionDescription:
      "Вы делаете выводы на основе того, что чувствуете. Например: «Я чувствую тревогу, значит, я действительно в опасности». Или: «Я чувствую себя неудачником, значит, скорее всего, я неудачник».",
  },
  {
    distortionName: "Императивы",
    distortionDescription:
      "Вы употребляете слова «должен», «не должен», «обязан» или «придется».",
  },
  {
    distortionName: "Ярлыки",
    distortionDescription:
      "Вы делаете обобщение, приравнивая один недостаток или промах ко всей своей личности. Вместо того чтобы сказать «Я сделал ошибку», вы обзываете себя «неудачником». Это — крайняя форма сверхобобщения.",
  },
  {
    distortionName: "Вина: самообвинение",
    distortionDescription:
      "Вместо того чтобы определить причину проблемы, вы ищете виноватых. Вы обвиняете себя в том, в чем нет вашей вины, и безжалостно ругаете себя, совершив ошибку.",
  },
  {
    distortionName: "Вина: обвинение других",
    distortionDescription:
      "Вместо того чтобы определить причину проблемы, вы ищете виноватых. Вы обвиняете других людей и отрицаете свою собственную роль в сложившейся ситуации.",
  },
]
export const techniques = [
  {
    modelName: "Когнитивная модель",
    categories: [
      {
        categoryName: "Техники выявления убеждений",
        techniques: [
          {
            name: "Техника падающей стрелы.",
            desc: "Техника падающей стрелы поможет вам определить иррациональные убеждения, которые делают вас уязвимыми перед депрессией и тревогой. Нарисуйте стрелку, направленную вниз, под негативной мыслью и спросите себя: «Если бы эта мысль была истинной, почему это меня так расстраивало бы? Что бы это означало для меня?» В уме всплывет новая негативная мысль. Запишите ее под стрелкой и нарисуйте еще одну стрелку под ней. Повторите этот процесс несколько раз. Теперь посмотрите на негативные мысли, которые вы записали, и пересмотрите список иррациональных убеждений, чтобы определить убеждение, которое лежит в основе ваших страданий.",
          },
          {
            name: "Техника «Что, если»",
            desc: "Эта техника поможет вам определить фантазию, которая питает ваши страхи. Нарисуйте стрелку, направленную вниз, под негативной мыслью и спросите себя: «Что самое страшное может произойти, если бы это была правда?» Вам на ум придет еще одна негативная мысль. Запишите ее под стрелкой и повторите процесс несколько раз. Затем спросите себя: «Насколько вероятно, что это произойдет? И смогу ли я с этим жить, если это все-таки случится?»",
          },
        ],
      },
      {
        categoryName: "Техника, основанная на сострадании",
        techniques: [
          {
            name: "Техника двойных стандартов",
            desc: "Вместо того чтобы ругать или унижать себя, вы можете разговаривать с собой так же сострадательно, как вы разговариваете с близким другом, если он расстроен. Спросите себя: «Говорил бы я такие неприятные вещи другу, если бы у него возникла такая же проблема? Что бы я сказал ему или ей?»",
          },
        ],
      },
      {
        categoryName: "Техники, основанные на истине",
        techniques: [
          {
            name: "Изучение доказательств",
            desc: "Вместо того чтобы предполагать, что ваша негативная мысль истинна, спросите себя: «Каковы доказательства этого утверждения?»",
          },
          {
            name: "Техника эксперимента",
            desc: "Спросите себя: «Как я могу проверить эту мысль, чтобы выяснить, истинна она или нет?» Например, если вы страдаете от панических атак, потому что говорите себе, что вот-вот сойдете с ума, вы можете попытаться свести себя с ума, издавая страшные крики, катаясь по полу и неистово мечась. Таким образом вы можете выяснить, реалистичны ли ваши опасения.",
          },
          {
            name: "Техника опроса",
            desc: "Проведите опрос, чтобы проверить вашу негативную мысль. Например, если вы думаете, что ваша застенчивость — это что-то ненормальное или что ее нужно стыдиться, вы можете опросить нескольких друзей, стеснялись ли они когда-нибудь. Вероятно, вы обнаружите, что большинство людей порой стесняются.",
          },
          {
            name: "Реатрибуция",
            desc: "Если вы встревожены или подавлены, вы можете отчаянно ругать или винить себя в своих неудачах. Когда вы применяете реатрибуцию, вы принимаете в расчет все факты, которые создали вашу проблему, и концентрируетесь на том, чтобы научиться чему-то из этого опыта, а не винить себя и не раздирать себя на клочки.",
          },
        ],
      },
      {
        categoryName: "Семантические техники",
        techniques: [
          {
            name: "Семантический метод",
            desc: "Семантический метод особенно хорошо помогает при императивах и ярлыках. Вы просто заменяете их на формулировки, которые будут менее оскорбительными и эмоционально заряженными.",
          },
          {
            name: "Определимся с терминами",
            desc: "Когда вы вешаете на себя ярлыки «дурака» или «невротика», спросите себя, что на самом деле означают эти ярлыки. Вы увидите, что не существует таких понятий, как «дурак» или «невротик». Существует глупое или невротичное поведение, но не «дураки» или «невротики».",
          },
          {
            name: "Будь конкретнее",
            desc: "Когда вы используете технику «Будь конкретнее», вы пытаетесь установить связь с реальностью и избежать глобальных суждений о ней. Вместо того чтобы думать о себе как о «неудачнике», вы можете определить ваши конкретные сильные и слабые стороны.",
          },
        ],
      },
      {
        categoryName: "Техники, основанные на логике",
        techniques: [
          {
            name: "Мышление в оттенках серого",
            desc: "Вместо того чтобы думать о себе в черно-белых тонах, вы оцениваете ситуацию более реалистично, избегая крайностей и используя шкалу оттенков серого.",
          },
          {
            name: "Процесс vs результат",
            desc: "Оцените ваши успехи, основываясь на процессе и на усилиях, которые вы вкладываете, а не на результате. Ваша подготовка и упорная работа всегда подвластны вашему контролю, в отличие от результата.",
          },
        ],
      },
      {
        categoryName: "Количественные техники",
        techniques: [
          {
            name: "Самонаблюдение",
            desc: "Вы можете отслеживать негативные мысли и фантазии, подсчитывая их. В конце дня запишите общее количество мыслей в календаре и установите счетчик обратно на 0. Если делать это в течение нескольких недель, негативные мысли часто ослабевают или полностью исчезают.",
          },
          {
            name: "Перерывы на беспокойство",
            desc: "Это парадоксальная техника. Вы планируете промежуток времени, чтобы дать себе прочувствовать депрессию, тревогу или вину. Например, если постоянное беспокойство не позволяет вам эффективно готовиться к экзамену, вы можете устраивать двухминутные перерывы на беспокойство каждый час. Во время каждого такого перерыва можете говорить себе, что обязательно провалитесь. Рвите себя на части и пытайтесь вызвать у себя как можно более сильное чувство тревоги. Не пытайтесь побороть эти чувства. Вы можете использовать весь оставшийся час для учебы и подготовки к экзамену. Если вы начнете нервничать, напомните себе, что вы можете отложить свою тревогу до следующего перерыва на беспокойство",
          },
        ],
      },
      {
        categoryName: "Техники, основанные на юморе",
        techniques: [
          {
            name: "Противостыдные упражнения",
            desc: "Эта техника прекрасно подходит людям, которые страдают от застенчивости. Вместо того чтобы изо всех сил стараться выглядеть нормальным, вы намеренно делаете что-то глупое у всех на виду, например громко объявляете время в людном магазине или выкрикиваете названия улиц в автобусе на каждой остановке. Вы обнаружите, что мир от этого не рушится. Хотя эта техника требует большой смелости, она может принести огромное чувство свободы и облегчения. Противостыдные упражнения также являются формой межличностной экспозиции.",
          },
          {
            name: "Парадоксальное преувеличение",
            desc: "Вместо того чтобы бороться со своими негативными мыслями, вы их усиливаете. Парадоксальным образом, именно в этот момент они начинают казаться абсурдными.",
          },
          {
            name: "Комедийная визуализация",
            desc: "Когда вы охвачены тревогой или гневом, иногда помогает представить что-то смешное. Одна женщина в депрессии никак не могла отделаться от навязчивых мыслей о том, как ее обвели вокруг пальца во время бракоразводного процесса. Она едва могла свести концы с концами и впадала в ярость каждый раз, когда воображала, как ее бывший муж обнимается со своей молодой красивой женой на своей яхте и как они живут в роскоши. Постоянные чувства гнева и обиды делали ее несчастной. Она обнаружила, что ей становится смешно, когда она представляет, как он приходит на заседание совета директоров в одних подштанниках. Это оказалось действенным противоядием от чувств гнева и обиды, которые лишали ее всех сил.",
          },
        ],
      },
      {
        categoryName: "Ролевая техника",
        techniques: [
          {
            name: "Озвучивание голосов",
            desc: "Вы с напарником по очереди разыгрываете роли негативных и позитивных мыслей. Человек, который играет роль атакующих негативных мыслей, использует местоимение второго лица «ты», а человек, который играет роль защищающих позитивных мыслей, использует местоимение первого лица «я». Меняйтесь ролями, если окажетесь в тупике. Некоторые другие техники также хороши в ролевом формате, в том числе техника двойных стандартов, парадокс принятия, «Адвокат дьявола», «Самый сильный страх», тренинг флирта и техника Дэвида Леттермана.",
          },
        ],
      },
      {
        categoryName: "Духовная техника",
        techniques: [
          {
            name: "Парадокс принятия",
            desc: "Вы воспринимаете свои неудачи и недостатки спокойно и с чувством юмора. Парадокс принятия основан на следующем буддийском принципе: защищаясь, вы создаете состояние войны. Если вы выступаете против своей собственной самокритики, вы вступаете в борьбу с самим собой. И когда вы обнаруживаете зерно истины в критике, вы лишаете противника силы. Конечно, вы сами и есть этот противник, и поэтому вы становитесь другом самому себе. Это самая важная и самая мощная техника из всех, но, возможно, поначалу будет трудно ее освоить. Она начинает действовать, когда вы комбинируете ее с ролевой техникой, такой как озвучивание голосов или «Самый сильный страх».",
          },
        ],
      },
      {
        categoryName: "Мотивационные техники",
        techniques: [
          {
            name: "Анализ преимуществ и недостатков (АПН)",
            desc: "Перечислите все преимущества и недостатки негативной мысли («Я такой неудачник»), иррационального убеждения («Я всегда должен стремиться к совершенству»), чувства (гнев, вина или тревога) или привычки (выпивка, употребление наркотиков, переедание или прокрастинация). Также вы можете перечислить преимущества и недостатки обвинения другого человека в проблемах в отношениях с ним. Спросите себя: «Каковы преимущества и недостатки этой мысли, убеждения, чувства или привычки? Как это мне помогает и как это мне вредит?» После того как вы перечислите все преимущества и недостатки, которые можете придумать, взвесьте их относительно друг друга по 100-балльной шкале. Спросите себя, перевешивают преимущества или недостатки.",
          },
          {
            name: "Парадоксальный АПН",
            desc: "Перечислите только преимущества негативной мысли или чувства. Это поможет вам осознать могущественные силы, которые удерживают вас в депрессии или заставляют испытывать тревогу. Теперь спросите себя: «Учитывая все преимущества убеждения или чувства, почему я хочу измениться?» Когда вы осознаете все скрытые выгоды, они, скорее всего, потеряют свою силу и больше не смогут одержать победу над вами.",
          },
          {
            name: "Адвокат дьявола",
            desc: "Перечислите все соблазнительные мысли, которые у вас возникают перед тем, как вы поддаетесь побуждению выпить, объесться, прокрастинировать или пойти на свидание не с тем человеком. Отдайте список другу и попросите его сыграть роль дьявола, который соблазняет вас. Ваш друг должен будет искушать вас, как только может, и использовать, например, такие фразы: «Почему бы тебе не съесть эту шоколадку? М-м-м... Она будет такой вкусной!» Ваша задача — дать ответ соблазняющим мыслям и победить дьявола.",
          },
        ],
      },
      {
        categoryName: "Техники работы с прокрастинацией",
        techniques: [
          {
            name: "Бланк предполагаемого удовольствия",
            desc: "Запланируйте занятия, которые потенциально могут принести вам удовольствие, быть полезными для вашего обучения и личностного роста. Спрогнозируйте, сколько удовольствия или пользы принесет каждое занятие, от 0 (никакого) до 100% (абсолютное). После того как вы завершите каждое занятие, запишите, сколько удовольствия оно в действительности принесло, используя ту же шкалу. Возможно, вы обнаружите, что многие занятия приносят больше удовольствия, чем вы предполагали. Вы можете использовать эту технику, чтобы проверить некоторые иррациональные убеждения, такие как «Мне нужна любовь, чтобы чувствовать себя счастливым и достойным. Если я один, я обречен быть несчастным».",
          },
          {
            name: "Маленькие шаги к большим победам",
            desc: "Если вас охватывает беспокойство перед лицом слишком крупной задачи, разбейте ее на несколько небольших частей. Вы можете выполнять по одному шагу за раз.",
          },
          {
            name: "Бланк антипрокрастинации",
            desc: "Разбейте большую задачу на несколько маленьких шагов и предположите, насколько трудным и насколько удовлетворяющим окажется каждый шаг по шкале от 0 до 100%. По завершении каждого шага оцените, насколько трудным и удовлетворяющим он оказался на самом деле, используя ту же шкалу. Вполне вероятно, вы увидите, что каждый из этих шагов оказался более простым и результативным, чем вы ожидали.",
          },
          {
            name: "Список проблем и решений",
            desc: "Выберите конкретное время, когда вы хотите начать работать над задачей, которую вы откладывали. Разделите лист бумаги на две колонки и озаглавьте их «Проблемы» и «Решения». Перечислите все преграды, которые не позволяют вам начать работу, в колонке «Проблемы». Затем запишите, как вы можете решить каждую из этих проблем, в колонке «Решения».",
          },
        ],
      },
    ],
  },
  {
    modelName: "Экспозиционная модель",
    categories: [
      {
        categoryName: "Классическая экспозиция",
        techniques: [
          {
            name: "Последовательное приближение",
            desc: "Когда вы используете технику последовательного приближения, вы встречаетесь со своим страхом постепенно, небольшими шагами, так что это не повергает вас в сильный ужас. Например, если вы боитесь лифтов, вы можете зайти в кабину, проехать один этаж и выйти. Когда вам будет достаточно комфортно это делать, вы можете проехать на лифте два этажа и таким образом постепенно увеличивать период времени, которое вы проводите в лифте. Вы можете использовать последовательное приближение при любой фобии, например при страхе высоты или собак, а также при других формах тревоги, таких как застенчивость или обсессивно-компульсивное расстройство. Вы также можете составить иерархию страхов, указав наименее угрожающую ситуацию под цифрой 1, а наиболее угрожающую — под цифрой 10. Вы можете каждый день записывать степень экспозиции, которой себя подвергаете, а также насколько тревожно вы себя при этом чувствуете, от 0 до 100%",
          },
          {
            name: "Погружение",
            desc: "Когда вы используете погружение, вы сразу максимально окунаетесь в то, чего боитесь. Например, вас беспокоит страх лифтов, и вы можете заставить себя сесть в лифт и ездить в нем вверх и вниз, невзирая на то, насколько тревожно вы себя будете чувствовать, пока страх полностью не исчезнет. Погружение является более пугающей техникой, чем последовательное приближение, но быстрее приносит результат. Оба подхода успешно используются в лечении тревоги, так что вы можете применять тот подход, который вам больше нравится.",
          },
          {
            name: "Предотвращение тревожной реакции",
            desc: "Вы отказываетесь следовать своему компульсивному ритуалу. Например, если вами движет сильнейший импульс проверить почтовый ящик после того, как вы бросили письмо, чтобы убедиться, что оно не застряло, вы можете заставить себя уйти и не проверять его. Ваша тревога тут же усилится, но лишь на время. Если вы откажетесь поддаться этому импульсу, тревога постепенно исчезнет. Подобным образом работает отказ от психоактивных веществ при работе с зависимостями.",
          },
          {
            name: "Отвлечение внимания",
            desc: "Если вы чувствуете тревогу, то можете отвлечь себя от неприятных мыслей. Например, если вы чувствуете панику во время полета, вы можете сосредоточиться на кроссворде или занять разговором пассажира рядом с вами. Эта техника лучше всего работает в сочетании с другими техниками экспозиции, такими как погружение.",
          },
        ],
      },
      {
        categoryName: "Когнитивное погружение",
        techniques: [
          {
            name: "Когнитивное погружение",
            desc: "Иногда бывает невозможно встретиться с тем, чего вы боитесь, в реальности. Например, если у вас страх полетов, вы не можете устроить крушение самолета, чтобы преодолеть свой страх! Однако вы можете бороться с этим страхом в вашем уме, используя технику когнитивного погружения. Представьте, что ваш самолет терпит крушение. Попробуйте вызвать у себя максимально сильную тревогу и выдержать ее так долго, как сможете. Не пытайтесь бороться с тревогой. Вместо этого усиливайте ее как можно больше. Поддайтесь ей. Постепенно тревога выжжет сама себя.",
          },
          {
            name: "Замена образов",
            desc: "Замените пугающий образ в своем уме на более позитивный или спокойный. Если вы боитесь полетов, возможно, вы представляете, как ваш самолет летит к земле, охваченный пламенем. Этот образ создаст у вас чувство сильнейший тревоги. Вместо этого вы можете представить, как безопасно приземляетесь и наслаждаетесь чудесным отпуском с вашей семьей.",
          },
          {
            name: "Переписывание воспоминаний",
            desc: "Если вы стали жертвой ужасающего или травмирующего события, возможно, вас мучают болезненно яркие воспоминания о том, что произошло. Вы можете изменить эти образы подобно тому, как режиссер фильма делает монтаж. Например, если вам не дает покоя память об унижении, изнасиловании или проявлении жестокости, вы можете прокручивать эти воспоминания в вашем уме, пока тревога не достигнет пика. Затем вы можете войти в эту сцену в роли сильного взрослого и наказать того, кто причинял вам вред. Также вы можете поговорить с ребенком, который пережил этот опыт, чтобы утешить его. Конечно, в этом случае ваше любящее взрослое «я» разговаривает с ребенком внутри вас, который чувствует себя раненым, преданным, испуганным и нелюбимым.",
          },
          {
            name: "Самый сильный страх",
            desc: "Вы погружаетесь в мир кошмаров, как будто из «Алисы в Стране чудес», где ваши самые сильные страхи становятся реальностью. Вы встречаетесь с воображаемым злобным критиком, который пытается самым жестоким образом разделаться с вами и безжалостно разносит все ваши слабости и недостатки. Вы можете применить самозащиту и вступить в спор с критиком или использовать парадокс принятия, таким образом лишая критика его силы. Также вы можете сочетать парадигму самозащиты с парадоксом принятия. Хотя злобный критик и кажется отдельной личностью, на самом деле это лишь проекция вашей собственной самокритичной части ума. Вы можете разыграть по ролям технику самого сильного страха с помощью вашего терапевта или друга или самостоятельно записать диалог на бумаге",
          },
        ],
      },
      {
        categoryName: "Межличностная экспозиция",
        techniques: [
          {
            name: "Практика «Улыбнись и поздоровайся»",
            desc: "Заставьте себя улыбаться и здороваться как минимум с 10 незнакомцами каждый день. Очень вероятно, что вы обнаружите, что люди оказываются гораздо более дружелюбными, чем вы ожидали.",
          },
          {
            name: "Тренинг флирта",
            desc: "Вы учитесь флиртовать с людьми в легкой и дружелюбной манере, не будучи слишком серьезным, искренним или навязчивым. Так вы будете казаться более игривым, загадочным и интригующим человеком.",
          },
          {
            name: "Практика отвержения",
            desc: "Если вы боитесь отвержения, можно попробовать пережить как можно больше отказов, чтобы обнаружить, что мир от этого не рушится. Например, вместо того чтобы пытаться назначить свидание, вы можете поставить себе цель добиться 10 отказов за неделю.",
          },
          {
            name: "Самораскрытие",
            desc: "Вместо того чтобы стыдливо прятать свои чувства застенчивости или нервозности, вы рассказываете о них расслабленно и открыто. Идея этой техники заключается в том, что настоящая проблема — в стыде, который вы испытываете, а не в застенчивости. Без чувства стыда застенчивость может даже стать преимуществом, потому что с ней вы кажетесь более очаровательным и уязвимым.",
          },
        ],
      },
    ],
  },
  {
    modelName: "Модель скрытых эмоций",
    categories: [
      {
        categoryName: "Техники выявления скрытых эмоций",
        techniques: [
          {
            name: "Техника выявления скрытых эмоций",
            desc: "Эта техника основана на идее, что тревога возникает только у хороших людей. На самом деле «хорошесть» и есть главная причина тревоги. Когда вы злитесь или расстроены, то можете прятать свои чувства так быстро, что даже не успеваете осознать, в чем проблема. Вы вытесняете проблему из своего сознания. Достаточно скоро вас охватывает беспокойство, чувство тревоги или паники, и вы даже не знаете почему. Когда вы встревожены, спросите себя: «Я сосредоточен на своей тревоге, чтобы избежать чего-то неприятного? В чем действительно заключается проблема, которая меня беспокоит? Есть ли у меня тайная обида на моего супруга, друга или коллегу? Чувствую ли я себя несчастным из-за своей работы или карьеры? Что я на самом деле чувствую по поводу того, что происходит в моей жизни?» Когда вы осознаете проблему, вы можете выразить свои чувства или поработать над тем, чтобы разрешить проблему, которая не дает вам покоя. Част что приводит к снижению или полному избавлению от тревоги. Техника скрытой эмоции может оказаться бесценной для людей, страдающих от ипохондрии, хронической боли, головокружений, усталости или других симптомов, не имеющих никакой видимой медицинской причины.",
          },
        ],
      },
    ],
  },
]
const anxiousResults = {
  moodKey: "Тревожные чувства",
  results: [
    {
      pointsRange: [0, 1],
      resultName: "Отсутствие тревожности или легкие симптомы.",
      resultDescription:
        "Это наилучший из возможных результатов. Прямо сейчас кажется, что тревога вас не беспокоит или почти не беспокоит.",
    },
    {
      pointsRange: [2, 4],
      resultName: "Пограничная тревога",
      resultDescription: "У вас проявляются небольшие симптомы тревожности.",
    },
    {
      pointsRange: [5, 8],
      resultName: "Легкая тревога",
      resultDescription:
        "Этот балл не очень высок, но тревога может доставлять вам значительные неудобства и стресс.",
    },
    {
      pointsRange: [9, 12],
      resultName: "Умеренная тревога",
      resultDescription:
        "Вы поставили умеренный балл или выше напротив по меньшей мере двух пунктов. Такой тревоги достаточно, чтобы вызывать сильный стресс. Определенно, ваше состояние можно улучшить.",
    },
    {
      pointsRange: [13, 16],
      resultName: "Сильная тревога",
      resultDescription:
        "Этот балл указывает на то, что вы испытываете серьезное чувство тревоги. Вам, мягко говоря, некомфортно. Хорошие новости в том, что, если вы наберетесь смелости и как следует поработаете над вашим состоянием, прогнозы улучшения весьма положительные.",
    },
    {
      pointsRange: [17, 20],
      resultName: "Крайне сильная тревога",
      resultDescription:
        "Кажется, сегодня вас одолевает сильнейшее чувство тревоги, и, возможно, вы серьезно страдаете. Техники из КПТ, так же как профессиональная помощь, могут вам сейчас очень пригодиться.",
    },
  ],
}
const physicalResults = {
  moodKey: "Физические симптомы тревоги",
  results: [
    {
      pointsRange: [0, 2],
      resultName: "Слабые или отсутствующие физические симптомы тревожности",
      resultDescription:
        "Физические симптомы тревожности выражены слабо или отсутствуют.",
    },
    {
      pointsRange: [3, 6],
      resultName: "Некоторые физические симптомы тревожности",
      resultDescription:
        "У вас проявляются некоторые из физических симптомов тревожности.",
    },
    {
      pointsRange: [7, 10],
      resultName: "Легкие физические симптомы тревожности",
      resultDescription:
        "Физические симптомы тревожности выражены слабо и вряд ли доставляют значительный дискомфорт.",
    },
    {
      pointsRange: [11, 20],
      resultName: "Умеренные физические симптомы тревожности",
      resultDescription:
        "У вас проявляются умеренные физические симптомы тревожности, которые могут доставлять неудобства.",
    },
    {
      pointsRange: [21, 30],
      resultName: "Сильные физические симптомы тревожности",
      resultDescription:
        "Физические симптомы тревожности выражены достаточно сильно, чтобы вызывать дискомфорт и мешать вашей повседневной жизни.",
    },
    {
      pointsRange: [31, 40],
      resultName: "Очень сильные физические симптомы тревожности",
      resultDescription:
        "Физические симптомы тревожности очень выражены. Возможно, они значительно ухудшают ваше самочувствие. Стоит обратить внимание на их интенсивность и обратиться за помощью.",
    },
  ],
}
const depressionResults = {
  moodKey: "Депрессивые симптомы",
  results: [
    {
      pointsRange: [0, 1],
      resultName: "Отсутствие депрессии или минимальные симптомы",
      resultDescription:
        "Симптомов депрессии мало или они полностью отсутствуют. Это наилучший из возможных результатов. В настоящий момент депрессия не составляет для вас большой проблемы. Если она и проявлялась раньше, этот результат — показатель вашего прогресса. Упорство и настойчивость помогут сохранить этот результат.",
    },
    {
      pointsRange: [2, 4],
      resultName: "Пограничная степень депрессии",
      resultDescription:
        "Ваши симптомы депрессии минимальны. Вероятно, вам потребуется лишь небольшая психологическая настройка. Это состояние может напоминать невысокую температуру: не критично, но лишает вас сил и мотивации. Важно не позволять пограничной депрессии взять верх, чтобы избежать ухудшения. Многие техники из КПТ будут полезны в работе с депрессией.",
    },
    {
      pointsRange: [5, 8],
      resultName: "Легкая депрессия",
      resultDescription:
        "У вас проявляются несколько легких симптомов депрессии и, возможно, пара более тяжелых. Хоть это не высокая степень депрессии, она может существенно повлиять на вашу самооценку и радость от жизни.",
    },
    {
      pointsRange: [9, 12],
      resultName: "Умеренная депрессия",
      resultDescription:
        "Это значительный уровень депрессии. У многих людей состояние в этом диапазоне может сохраняться месяцами или даже годами. Хотя прогнозы улучшения очень положительные, важно не поддаваться убеждению, что изменения невозможны. Отказ от борьбы может закрепить это состояние, но работа над собой может вернуть радость и уверенность в себе.",
    },
    {
      pointsRange: [13, 16],
      resultName: "Тяжелая депрессия",
      resultDescription:
        "Люди с этим уровнем депрессии обычно чувствуют грусть, никчемность, отсутствие мотивации и радости. Это состояние может быть настолько глубоким, что другим трудно его понять. Поверхностные советы от окружающих могут ухудшить ваше состояние. Тем не менее, прогноз излечения превосходен, даже если сейчас это кажется невозможным.",
    },
    {
      pointsRange: [17, 20],
      resultName: "Крайне тяжелая депрессия",
      resultDescription:
        "Этот уровень депрессии сопровождается практически невероятными страданиями. Несмотря на это, прогноз улучшения остается очень положительным. Техники самопомощи могут быть полезными, но профессиональная помощь также крайне рекомендуется. Это похоже на ситуацию, когда вы потерялись в лесу: хороший проводник может помочь вам найти дорогу к выздоровлению.",
    },
  ],
}

export const moodResults = {
  anxiousResults,
  physicalResults,
  depressionResults,
}
