export const distortions = [
  {
    distortionName: "Мышление «всё или ничего»",
    distortionDescription:
      "Для вас существуют только крайности, только черное и белое. Если вы не достигли абсолютного успеха, то считаете себя полным неудачником.",
  },
  {
    distortionName: "Сверхобобщение",
    distortionDescription:
      "Одно негативное событие для вас является свидетельством непрекращающейся череды неудач. Возможно, вы говорите самому себе: «Ну, так всегда и происходит» или «У меня никогда ничего не выйдет».",
  },
  {
    distortionName: "Негативный фильтр",
    distortionDescription:
      "Это искажение подобно капле чернил, которая меняет цвет воды во всем кувшине. Вы цепляетесь за одну негативную деталь, такую как совершенная вами ошибка, и игнорируете все, что сделали хорошо.",
  },
  {
    distortionName: "Обесценивание положительного",
    distortionDescription:
      "Вы уверены, что ваши достижения и положительные качества ничего не стоят.",
  },
  {
    distortionName: "Поспешные выводы: чтение мыслей",
    distortionDescription:
      "Вы делаете поспешные выводы, не подкрепленные фактами. Вы безосновательно предполагаете, что люди относятся к вам с осуждением и презрением.",
  },
  {
    distortionName: "Поспешные выводы: ошибка предсказания",
    distortionDescription:
      "Вы делаете поспешные выводы, не подкрепленные фактами. Вы убеждаете себя, что произойдет нечто ужасное: «Я просто знаю, что провалюсь на экзаменах на следующей неделе».",
  },
  {
    distortionName: "Преувеличение и преуменьшение",
    distortionDescription:
      "Вы раздуваете одни факты до огромного размера, а другие полностью лишаете значимости. Это также называется эффектом бинокля. Вы смотрите в бинокль с одного конца, и все ваши несовершенства кажутся огромными, как гора Эверест. А когда смотрите с другого конца, то видите, что ваши сильные стороны и положительные качества сжались до ничтожного размера.",
  },
  {
    distortionName: "Эмоциональное обоснование",
    distortionDescription:
      "Вы делаете выводы на основе того, что чувствуете. Например: «Я чувствую тревогу, значит, я действительно в опасности». Или: «Я чувствую себя неудачником, значит, скорее всего, я неудачник».",
  },
  {
    distortionName: "Императивы",
    distortionDescription:
      "Вы употребляете слова «должен», «не должен», «обязан» или «придется».",
  },
  {
    distortionName: "Ярлыки",
    distortionDescription:
      "Вы делаете обобщение, приравнивая один недостаток или промах ко всей своей личности. Вместо того чтобы сказать «Я сделал ошибку», вы обзываете себя «неудачником». Это — крайняя форма сверхобобщения.",
  },
  {
    distortionName: "Вина: самообвинение",
    distortionDescription:
      "Вместо того чтобы определить причину проблемы, вы ищете виноватых. Вы обвиняете себя в том, в чем нет вашей вины, и безжалостно ругаете себя, совершив ошибку.",
  },
  {
    distortionName: "Вина: обвинение других",
    distortionDescription:
      "Вместо того чтобы определить причину проблемы, вы ищете виноватых. Вы обвиняете других людей и отрицаете свою собственную роль в сложившейся ситуации.",
  },
]
export const techniques = [
  {
    modelName: "Когнитивная модель",
    categories: [
      {
        categoryName: "Техники выявления убеждений",
        techniques: ["Техника падающей стрелы", "Техника «Что, если»"],
      },
      {
        categoryName: "Техника, основанная на сострадании",
        techniques: ["Техника двойных стандартов"],
      },
      {
        categoryName: "Техники, основанные на истине",
        techniques: [
          "Изучение доказательств",
          "Техника эксперимента",
          "Техника опроса",
          "Реатрибуция",
        ],
      },
      {
        categoryName: "Семантические техники",
        techniques: [
          "Семантический метод",
          "Определимся с терминами",
          "Будь конкретнее",
        ],
      },
      {
        categoryName: "Техники, основанные на логике",
        techniques: ["Мышление в оттенках серого", "Процесс vs результат"],
      },
      {
        categoryName: "Количественные техники",
        techniques: ["Самонаблюдение", "Перерывы на беспокойство"],
      },
      {
        categoryName: "Техники, основанные на юморе",
        techniques: [
          "Противостыдные упражнения",
          "Парадоксальное преувеличение",
          "Комедийная визуализация",
        ],
      },
      {
        categoryName: "Ролевая техника",
        techniques: ["Озвучивание голосов"],
      },
      {
        categoryName: "Духовная техника",
        techniques: ["Парадокс принятия"],
      },
      {
        categoryName: "Мотивационные техники",
        techniques: [
          "Анализ преимуществ и недостатков (АПН)",
          "Парадоксальный АПН",
          "Адвокат дьявола",
        ],
      },
      {
        categoryName: "Техники работы с прокрастинацией",
        techniques: [
          "Бланк предполагаемого удовольствия",
          "Маленькие шаги к большим победам",
          "Листок антипрокрастинации",
          "Список проблем и решений",
        ],
      },
    ],
  },
  {
    modelName: "Экспозиционная модель",
    categories: [
      {
        categoryName: "Классическая экспозиция",
        techniques: [
          "Последовательное приближение",
          "Погружение",
          "Предотвращение тревожной реакции",
          "Отвлечение внимания",
        ],
      },
      {
        categoryName: "Когнитивная экспозиция",
        techniques: [
          "Когнитивное погружение",
          "Замена образов",
          "Переписывание воспоминаний",
          "Самый сильный страх",
        ],
      },
      {
        categoryName: "Межличностная экспозиция",
        techniques: [
          "Практика «Улыбнись и поздоровайся»",
          "Тренинг флирта",
          "Практика отвержения",
          "Самораскрытие",
          "Техника Дэвида Леттермана",
        ],
      },
    ],
  },
  {
    modelName: "Модель скрытых эмоций",
    categories: [
      {
        categoryName: "Техники выявления скрытых эмоций",
        techniques: ["Техника выявления скрытых эмоций"],
      },
    ],
  },
]
const anxiousResults = {
  moodKey: "Тревожные чувства",
  results: [
    {
      pointsRange: [0, 1],
      resultName: "Отсутствие тревожности или легкие симптомы.",
      resultDescription:
        "Это наилучший из возможных результатов. Прямо сейчас кажется, что тревога вас не беспокоит или почти не беспокоит.",
    },
    {
      pointsRange: [2, 4],
      resultName: "Пограничная тревога",
      resultDescription: "У вас проявляются небольшие симптомы тревожности.",
    },
    {
      pointsRange: [5, 8],
      resultName: "Легкая тревога",
      resultDescription:
        "Этот балл не очень высок, но тревога может доставлять вам значительные неудобства и стресс.",
    },
    {
      pointsRange: [9, 12],
      resultName: "Умеренная тревога",
      resultDescription:
        "Вы поставили умеренный балл или выше напротив по меньшей мере двух пунктов. Такой тревоги достаточно, чтобы вызывать сильный стресс. Определенно, ваше состояние можно улучшить.",
    },
    {
      pointsRange: [13, 16],
      resultName: "Сильная тревога",
      resultDescription:
        "Этот балл указывает на то, что вы испытываете серьезное чувство тревоги. Вам, мягко говоря, некомфортно. Хорошие новости в том, что, если вы наберетесь смелости и как следует поработаете над вашим состоянием, прогнозы улучшения весьма положительные.",
    },
    {
      pointsRange: [17, 20],
      resultName: "Крайне сильная тревога",
      resultDescription:
        "Кажется, сегодня вас одолевает сильнейшее чувство тревоги, и, возможно, вы серьезно страдаете. Техники из КПТ, так же как профессиональная помощь, могут вам сейчас очень пригодиться.",
    },
  ],
}
const physicalResults = {
  moodKey: "Физические симптомы тревоги",
  results: [
    {
      pointsRange: [0, 2],
      resultName: "Слабые или отсутствующие физические симптомы тревожности",
      resultDescription:
        "Физические симптомы тревожности выражены слабо или отсутствуют.",
    },
    {
      pointsRange: [3, 6],
      resultName: "Некоторые физические симптомы тревожности",
      resultDescription:
        "У вас проявляются некоторые из физических симптомов тревожности.",
    },
    {
      pointsRange: [7, 10],
      resultName: "Легкие физические симптомы тревожности",
      resultDescription:
        "Физические симптомы тревожности выражены слабо и вряд ли доставляют значительный дискомфорт.",
    },
    {
      pointsRange: [11, 20],
      resultName: "Умеренные физические симптомы тревожности",
      resultDescription:
        "У вас проявляются умеренные физические симптомы тревожности, которые могут доставлять неудобства.",
    },
    {
      pointsRange: [21, 30],
      resultName: "Сильные физические симптомы тревожности",
      resultDescription:
        "Физические симптомы тревожности выражены достаточно сильно, чтобы вызывать дискомфорт и мешать вашей повседневной жизни.",
    },
    {
      pointsRange: [31, 40],
      resultName: "Очень сильные физические симптомы тревожности",
      resultDescription:
        "Физические симптомы тревожности очень выражены. Возможно, они значительно ухудшают ваше самочувствие. Стоит обратить внимание на их интенсивность и обратиться за помощью.",
    },
  ],
}
const depressionResults = {
  moodKey: "Депрессивые симптомы",
  results: [
    {
      pointsRange: [0, 1],
      resultName: "Отсутствие депрессии или минимальные симптомы",
      resultDescription:
        "Симптомов депрессии мало или они полностью отсутствуют. Это наилучший из возможных результатов. В настоящий момент депрессия не составляет для вас большой проблемы. Если она и проявлялась раньше, этот результат — показатель вашего прогресса. Упорство и настойчивость помогут сохранить этот результат.",
    },
    {
      pointsRange: [2, 4],
      resultName: "Пограничная степень депрессии",
      resultDescription:
        "Ваши симптомы депрессии минимальны. Вероятно, вам потребуется лишь небольшая психологическая настройка. Это состояние может напоминать невысокую температуру: не критично, но лишает вас сил и мотивации. Важно не позволять пограничной депрессии взять верх, чтобы избежать ухудшения. Многие техники из КПТ будут полезны в работе с депрессией.",
    },
    {
      pointsRange: [5, 8],
      resultName: "Легкая депрессия",
      resultDescription:
        "У вас проявляются несколько легких симптомов депрессии и, возможно, пара более тяжелых. Хоть это не высокая степень депрессии, она может существенно повлиять на вашу самооценку и радость от жизни.",
    },
    {
      pointsRange: [9, 12],
      resultName: "Умеренная депрессия",
      resultDescription:
        "Это значительный уровень депрессии. У многих людей состояние в этом диапазоне может сохраняться месяцами или даже годами. Хотя прогнозы улучшения очень положительные, важно не поддаваться убеждению, что изменения невозможны. Отказ от борьбы может закрепить это состояние, но работа над собой может вернуть радость и уверенность в себе.",
    },
    {
      pointsRange: [13, 16],
      resultName: "Тяжелая депрессия",
      resultDescription:
        "Люди с этим уровнем депрессии обычно чувствуют грусть, никчемность, отсутствие мотивации и радости. Это состояние может быть настолько глубоким, что другим трудно его понять. Поверхностные советы от окружающих могут ухудшить ваше состояние. Тем не менее, прогноз излечения превосходен, даже если сейчас это кажется невозможным.",
    },
    {
      pointsRange: [17, 20],
      resultName: "Крайне тяжелая депрессия",
      resultDescription:
        "Этот уровень депрессии сопровождается практически невероятными страданиями. Несмотря на это, прогноз улучшения остается очень положительным. Техники самопомощи могут быть полезными, но профессиональная помощь также крайне рекомендуется. Это похоже на ситуацию, когда вы потерялись в лесу: хороший проводник может помочь вам найти дорогу к выздоровлению.",
    },
  ],
}

export const moodResults = {
  anxiousResults,
  physicalResults,
  depressionResults,
}
